DataProcessors/СозданиеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>СозданиеНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/СозданиеНоменклатуры/Forms/Форма/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура СоздатьНаСервере(Группа)
	
	Для Счетчик = 1 По 10000 Цикл
	
		Элемент = Справочники.Номенклатура.СоздатьЭлемент();
		Элемент.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар;
		Элемент.Родитель = Группа;
		Элемент.Наименование = "Товар " + Формат(Счетчик, "ЧЦ=5; ЧВН=; ЧГ=0");
		Элемент.Записать();
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	СоздатьНаСервере(Объект.Группа);
КонецПроцедуры
